In [9]:
#Series versus 1-column DataFrame
import pandas as pd

In [31]:
df=pd.read_csv('sales.csv',index_col='month')

In [32]:
df2=df.copy()

In [33]:
df2['tocino']=[0,0,50,60,70,80]

In [34]:
df2

         huevos   sal  jamon  tocino
month
Enero        47  12.0   17.0       0
Febrero     110  50.0   31.0       0
Marzo       221  89.0   72.0      50
Abril        77  87.0   20.0      60
Mayo        132   NaN   52.0      70
Junio       205  60.0   55.0      80

In [35]:
#Select columns with all nonzeros

In [36]:
df2.loc[:,df2.all()]

         huevos   sal  jamon
month
Enero        47  12.0   17.0
Febrero     110  50.0   31.0
Marzo       221  89.0   72.0
Abril        77  87.0   20.0
Mayo        132   NaN   52.0
Junio       205  60.0   55.0

In [37]:
#Select columns with any nonzeros

In [38]:
df2.loc[:,df2.any()]

         huevos   sal  jamon  tocino
month
Enero        47  12.0   17.0       0
Febrero     110  50.0   31.0       0
Marzo       221  89.0   72.0      50
Abril        77  87.0   20.0      60
Mayo        132   NaN   52.0      70
Junio       205  60.0   55.0      80

In [39]:
#Select columns with any NaNs

In [40]:
df2.loc[:,df2.isnull().any()]

          sal
month
Enero    12.0
Febrero  50.0
Marzo    89.0
Abril    87.0
Mayo      NaN
Junio    60.0

In [41]:
#Select columns without NaNs

In [42]:
df2.loc[:,df2.notnull().all()]

         huevos  jamon  tocino
month
Enero        47   17.0       0
Febrero     110   31.0       0
Marzo       221   72.0      50
Abril        77   20.0      60
Mayo        132   52.0      70
Junio       205   55.0      80

In [43]:
#Drop rows with any NaNs

In [44]:
df2.dropna(how='any')

         huevos   sal  jamon  tocino
month
Enero        47  12.0   17.0       0
Febrero     110  50.0   31.0       0
Marzo       221  89.0   72.0      50
Abril        77  87.0   20.0      60
Junio       205  60.0   55.0      80

In [45]:
#Filtering a column based on another

In [46]:
df2.huevos[df2.sal>55]

month
Marzo    221
Abril     77
Junio    205
Name: huevos, dtype: int64

In [26]:
#Modifying a column based on another

In [47]:
df2.huevos[df2.sal>55]+=5

/home/msi-lap/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [48]:
df2

         huevos   sal  jamon  tocino
month
Enero        47  12.0   17.0       0
Febrero     110  50.0   31.0       0
Marzo       226  89.0   72.0      50
Abril        82  87.0   20.0      60
Mayo        132   NaN   52.0      70
Junio       210  60.0   55.0      80